#pragma once


/*	인덱스에 따른 스테이터스
	0 : MoveRange
	1 : AttackMin
	2 : AttackMax
	3 : AttackRange
	4 : ArmorMin
	5 : ArmorMax
	6 : nHp
*/

// 레벨에 따른 능력치
int LevelStatusTable[3][3][7] = {
	{
		{ 2, 1, 2, 1, 3, 5, 100 },
		{ 2, 2, 3, 1, 5, 7, 120 },
		{ 3, 3, 4, 1, 7, 10, 140 }
	},
	{
		{ 3, 2, 5, 1, 1, 2, 80 },
		{ 4, 4, 7, 1, 2, 3, 100 },
		{ 5, 6, 9, 2, 4, 6, 120 }
	},
	{
		{ 1, 2, 4, 2, 0, 1, 50 },
		{ 1, 3, 5, 2, 1, 2, 60 },
		{ 2, 4, 6, 3, 2, 3, 70 }
	}
};

// 업그레이드에 따른 캐릭터 이름
char LevelCharacterNameTable[3][3][12] = {
	{
		{"약한기사"},
		{"기사"},
		{"강한기사"}
	},
	{
		{"약한기병"},
		{"기병"},
		{"강한기병"}
	},
	{
		{"약한궁병"},
		{"궁병"},
		{"강한궁병"}
	}
};

// 업그레이드에 따른 캐릭터 모양
char LevelCharacterShapeTable[3][3][3] = {
	{
		{"■"},
		{"▣"},
		{"◈"}
	},
	{
		{"§"},
		{"㏇"},
		{"╊"}
	},
	{
		{"＆"},
		{"※"},
		{"㉿"}
	}
};

// 업그레이드 비용
int LevelCharacterUpgradeCost[3][3] = {
	{ 0, 80, 150 },
	{ 0, 80, 150 },
	{ 0, 80, 150 }
};

// 캐릭터 클래스 이름
char CharacterClassName[3][12] = { "기사", "기병", "궁병" };
